print('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')

x = input('Введите первое недостающее слово: ')
y = input('Введите недостающюю букву(кожиц..й): ')
z = input('Введите второе недостающее слово: ')
t = input('Введите недостающюю букву(ножк..): ')
w = input('Введите третее недостающее слово: ')
b = input('Введите четвертое недостающее слово: ')
t = input('Введите недостающюю букву(шляпк..): ')

print('Шляпка гриба, покрытая ' + x + ' кожиц'+ y +'й, держится на '+ z +' ножк'+ t +'. Снизу шляпка затянута '+ w +' плёнкой. Когда её уберёшь, откроется нижняя '+ b +' сторона шляпк'+ t +'.')